МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_НаборыТестов/ТС_НаборыТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТС_НаборыТестов</name>
  <comment>Наборы тестов для разового тестирования в рамках данного курса</comment>
  <basedOn>Document.ТС_РезультатТестирования</basedOn>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ТС_Курсы</owners>
  <attributes>
    <name>ВключатьУстаревшие</name>
    <comment>Признак того, что в наборе тестов будут использоваться устаревшие тесты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Тест</name>
      <comment>Тест</comment>
      <type>
        <types>CatalogRef.ТС_Тесты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Documents/ТС_РезультатТестирования/ТС_РезультатТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТС_РезультатТестирования</name>
  <registerRecords>InformationRegister.ТС_РезультатыТестирований</registerRecords>
  <attributes>
    <name>НомерТестирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.ТС_Курсы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборТестов</name>
    <type>
      <types>CatalogRef.ТС_НаборыТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ТС_Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ТС_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭтапа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбменID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Тесты</name>
    <attributes>
      <name>Тест</name>
      <type>
        <types>CatalogRef.ТС_Тесты</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Правильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МУИВРазработка_системы_тестирования_обучающихся_на_базе_платформы_1СПредприятиеv2/src/Catalogs/ТС_НаборыТестов/ObjectModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТС_РезультатТестирования") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТС_РезультатТестированияТесты.Ссылка.Курс,
		|	ТС_РезультатТестированияТесты.Тест
		|ИЗ
		|	Документ.ТС_РезультатТестирования.Тесты КАК ТС_РезультатТестированияТесты
		|ГДЕ
		|	ТС_РезультатТестированияТесты.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТС_РезультатТестированияТесты.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);	
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать(); 	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Владелец = Справочники.ТС_Курсы.ПустаяСсылка() Тогда
				Владелец = ВыборкаДетальныеЗаписи.Курс;
			КонецЕсли;
			
			Содержание.Добавить().Тест = ВыборкаДетальныеЗаписи.Тест;		
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
